src/Documents/РасписаниеНаДату/РасписаниеНаДату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="67556fb8-e864-4231-8723-ea76290d615e">
  <name>РасписаниеНаДату</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6fd1ce15-c032-43c2-8cf9-6dca79c53a4f">
    <name>ДатаРасписания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dde63ae7-29cf-42db-856a-b876ad93cf14">
    <name>РасписаниеЗвонков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="dc7035b8-e6c1-468d-ac97-cf09aca28a5a">
    <name>Расписание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4cac6b1c-e4e9-4748-accb-372edb54de77">
      <name>УчебнаяГруппа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae01e799-3570-4515-a953-c0e5831af752">
      <name>Подгруппа</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5dafb3f2-e15f-4911-99e6-6cbd02ca9922">
      <name>НомерПары</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="af6ee208-511a-488c-9990-c4d52b7b0386">
      <name>Дисциплина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b95cb74a-cb80-4caa-8da1-574525953714">
      <name>Преподаватель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="43c40064-75b0-4d4c-9771-82ffb01d8139">
      <name>Аудитория</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="876a6bd1-d4af-475f-8ca0-58d6fcb124bf">
      <name>ВидНагрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/stdl_РасписаниеНаДату/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс
// Получить.
// 
// Параметры:
//  УИД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - ДокументСсылка.РасписаниеНаДату
Функция Получить(УИД) Экспорт
	РасписаниеНаДату = Документы.РасписаниеНаДату.ПолучитьСсылку(УИД);

	//@skip-check reading-attribute-from-database
	Если РасписаниеНаДату.ПолучитьОбъект() = Неопределено Или Не РасписаниеНаДату.Проведен
		Или РасписаниеНаДату.ПометкаУдаления Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат РасписаниеНаДату;
КонецФункции

// Получить по дате расписания.
// 
// Параметры:
//  ДатаРасписания - Дата
//  УчебнаяГруппа - СправочникСсылка.УчебныеГруппы
// 
// Возвращаемое значение:
//  - Неопределено
//  - ДокументСсылка.РасписаниеНаДату
Функция ПолучитьПоДатеРасписанияДляУчебнойГруппы(ДатаРасписания, УчебнаяГруппа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасписаниеНаДату.Ссылка
	|ИЗ
	|	Документ.РасписаниеНаДату КАК РасписаниеНаДату
	|ГДЕ
	|	РасписаниеНаДату.ДатаРасписания = &ДатаРасписания
	|	И РасписаниеНаДату.Проведен = ИСТИНА
	|	И РасписаниеНаДату.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ДатаРасписания", ДатаРасписания);
	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		//@skip-check property-return-type
		Ссылка = Выборка.Ссылка; // см. ДокументСсылка.РасписаниеНаДату
		//@skip-check reading-attribute-from-database
		Строки = Ссылка.Расписание.НайтиСтроки(Новый Структура("УчебнаяГруппа", УчебнаяГруппа));
		Если Строки.Количество() > 0 Тогда
			Возврат Ссылка;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;
КонецФункции
#КонецОбласти
